/**************************文件说明*****************************************************
* Copyright (c) 2019 ,杭州广安汽车电器有限公司  All rights reserved.
*
* 文件名称：MoudleDrive.h
* 功能描述：模块驱动接口
* 1  SignalFilter 端口定义
* 编译器： codewarrior IDE 11.1
* MCU说明：此文件跟MCU 相关，适用于KEAZ128
* 需要底层和应用状态
* */
/**************************更改记录******************************************************
 * 
* 版本：1.0
* 说明：初始版本建立
* 原作者：xb
* 完成日期：2020年1月14日
* 
* 
*/
#ifndef MOUDLEDRIVE_H_
#define MOUDLEDRIVE_H_


#endif /* MOUDLEDRIVE_H_ */
