/************************文件说明*****************************************************
* Copyright (c) 2019 ,杭州广安汽车电器有限公司  All rights reserved.
*
* 文件名称：Parameter.h
* 功能描述：HVAC 控制层的可更改参数，可通过标定软件更改放在此处。还有部分宏定义
* 注意此文件 只被HVACMainControl.c 包含
* 编译器： codewarrior IDE 11.1
* MCU说明：此模块为上层应用，与MCU无关
* 
*/
/**************************更改记录******************************************************
 * 
* 版本：1.0
*/
#include "DataType.h"

/*****************************************************************************
只能通过程序更改的参数
********************************************************************************/

#define   FANVOLT_RATE_MAN   255   //风量上升速度参数
#define   FANVOLT_RATE_INIT  20     
                               
/**************************项目可配置参数****************************************/
uint8  u8MIXMOTOR_HI_AD = 230, u8MIXMOTOR_LO_AD = 25;     //全冷全热参数
uint8  TBL_MODE_OSET[5] ={25, 74, 122, 168, 230};         //模式AD参数
uint8 TBL_NCFAD[]={50,240};                               //内外AD参数
//蒸发传感器参数
TempType   tACON_EVP= SCD_T(4) ,tACOFF_EVP = SCD_T(1);   

//鼓风机每当电压
VoltType  TBL_FANVOLT[MAX_FELVL+1] ={0 , 400, 500, 600, 700, 800, 1050, 1300}; // {0 , 50, 60, 70, 80, 90, 105, 120, 130};      //实车鼓风机电压数据

//ac 外温保护
const TempType  tAC_TAMBPRO_ON = SCD_T(-5) ;
const TempType  tAC_TAMBPRO_OFF = SCD_T(-3);
const TempType  tAC_TAMBPRO_DEF = SCD_T(3.5);

/**************************额外参数在此添加****************************************/

